data/DUCT/AR_7_Ret_180/constant/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "constant";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
15463
(
(0.0005 4.597582821e-05 4.705110026e-05)
(0.0005 0.0001337478639 4.705110026e-05)
(0.0005 0.0002135406236 4.705110026e-05)
(0.0005 0.000286079496 4.705110026e-05)
(0.0005 0.0003520239255 4.705110025e-05)
(0.0005 0.0004119734069 4.705110026e-05)
(0.0005 0.0004664729354 4.705110026e-05)
(0.0005 0.0005160179614 4.705110026e-05)
...
)
;

boundaryField
{
    inflow
    {
        type            cyclic;
    }
    outflow
    {
        type            cyclic;
    }
    wallTop
    {
        type            calculated;
        value           nonuniform List<vector> 
329
(
(0.0005 0.001 4.705110026e-05)
(0.0005 0.001 0.0001405285688)
(0.0005 0.001 0.0002327648682)
(0.0005 0.001 0.0003237764787)
(0.0005 0.001 0.0004135796612)
(0.0005 0.001 0.0005021904608)
(0.0005 0.001 0.0005896247098)
(0.0005 0.001 0.0006758980301)
...
)
;
    }
    wallSide
    {
        type            calculated;
        value           nonuniform List<vector> 
47
(
(0.0005 4.597582821e-05 0.007)
(0.0005 0.0001337478639 0.007)
(0.0005 0.0002135406236 0.007)
(0.0005 0.0002860794961 0.007)
(0.0005 0.0003520239255 0.007)
(0.0005 0.0004119734069 0.007)
(0.0005 0.0004664729355 0.007)
(0.0005 0.0005160179614 0.007)
...
)
;
    }
    symmetryBottom
    {
        type            symmetry;
    }
    symmetrySide
    {
        type            symmetry;
    }
}


// ************************************************************************* //
