data/DUCT/AR_7_Ret_180/0/k_LES
k_LES nonuniform List<scalar>
15463
(
5.086327472891025
5.5715022099946765
6.372018119032696
7.348360879459531
8.389524689125537
9.440630904960237
10.489117549280179
11.533265403223256
...
);
