data/DUCT/AR_7_Ret_180/0/tauij_LES
tauij_LES nonuniform List<symmTensor>
15463
(
(4.73663102107282 0.29818724884906217 0.0049652535504458115 2.690162277496222 6.661610560393171e-05 2.7458616539771055)
(5.374141521243112 0.872598791171955 0.0016284468982462345 2.793617217441235 -0.000527506638578974 2.975245670776053)
(6.403678140715188 1.4057830650329053 -0.003982688206540955 2.9770844869731197 -0.0029258595958621 3.363273564023484)
(7.611833182151998 1.9008726693387636 -0.007922526399469545 3.2165831951048927 -0.00565255352587269 3.8683053291572747)
(8.867390534335645 2.35656377221738 -0.01086749245736386 3.4918586038243187 -0.0047880555127865695 4.419800161213854)
(10.116142020328825 2.775321799094464 -0.017330038659032352 3.7825197126403824 -0.0018925246123843531 4.982600049991514)
(11.367879620131164 3.157930175105061 -0.01665946296221707 4.069010920512226 -0.0006711358001371413 5.541344517007192)
(12.652286967450166 3.5023616296213542 -0.012893398691076285 4.335207938199574 -0.0013510442998716885 6.0790358496680765)
...
);
