data/DUCT/AR_7_Ret_180/system/faceValues
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out surface files with interpolated field data in VTK format, e.g.
    cutting planes, iso-surfaces and patch boundary surfaces.

    This file includes a selection of example surfaces, each of which the user
    should configure and/or remove.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/visualization/surfaces.cfg"

#include "../caseDef"
#include "../fieldDef"

halfThickness   #calc "$h/2";

fields       $faceValuesFields;

surfaceFormat raw;

surfaces
(

    faceValues
    {
        type            cuttingPlane;
        planeType       pointAndNormal;
        pointAndNormalDict
        {
            point   ($halfThickness 0 0);
            normal  (1 0 0);
        }
        interpolate     false;
    }
);

// ************************************************************************* //
